Python 3.7.1 (v3.7.1:260ec2c36a, Oct 20 2018, 14:05:16) [MSC v.1915 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> [10,20,30][:]
[10, 20, 30]
>>> [10,20,30][1:]
[20, 30]
>>> #从元素1开始提取到最后
>>> a = [10,20,30,40,50,60]
>>> a[:]
[10, 20, 30, 40, 50, 60]
>>> a[1:3:1]
[20, 30]
>>> a[1::2]
[20, 40, 60]
>>> a[1:]
[20, 30, 40, 50, 60]
>>> a[:2]
[10, 20]
>>> a[1:3]
[20, 30]
>>> a[-3:]
[40, 50, 60]
>>> a[-5:-3]
[20, 30]
>>> a[::-1]
[60, 50, 40, 30, 20, 10]
>>> #如果起始偏移量小于0且终止偏移量大于长度减1也不影响
>>> #以下是列表的遍历
>>> for x in a:
	print(x)

	
10
20
30
40
50
60
>>> for x in a:
	print
